SignServiceTests/Assets/Smev2/Mr244/mr244_PFR3607SOAPRequest.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><!-- v 1.0.0 --><s:Header><wsse:Security xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:actor="http://smev.gosuslugi.ru/actors/smev"><wsse:BinarySecurityToken xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" u:Id="6005bb7a-b84f-4a09-ac2f-46e5f2100b48" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MIIJuzCCCWqgAwIBAgIKUq7PwAAAAAATYzAIBgYqhQMCAgMwggGyMRgwFgYFKoUD
ZAESDTEwMjMxMDE2NzA0MzcxGjAYBggqhQMDgQMBARIMMDAzMTIzMDc3MTExMSUw
IwYJKoZIhvcNAQkBFhZzZXJ2aWNldWNAYmVscmVnaW9uLnJ1MQswCQYDVQQGEwJS
VTEgMB4GA1UECQwX0J3QtdC60YDQsNGB0L7QstCwIDktMTUxMzAxBgNVBAgMKjMx
INCR0LXQu9Cz0L7RgNC+0LTRgdC60LDRjyDQvtCx0LvQsNGB0YLRjDEZMBcGA1UE
BwwQ0JHQtdC70LPQvtGA0L7QtDFQME4GA1UECgxH0J7Qk9CR0KMg0JHQtdC70LPQ
vtGA0L7QtNGB0LrQuNC5INC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdGL0Lkg0YTQ
vtC90LQxMDAuBgNVBAsMJ9Cj0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40Lkg0YbQ
tdC90YLRgDFQME4GA1UEAwxH0KPQpiDQkNC00LzQuNC90LjRgdGC0YDQsNGG0LjQ
uCDQkdC10LvQs9C+0YDQvtC00YHQutC+0Lkg0L7QsdC70LDRgdGC0LgwHhcNMTUw
MzE4MDgyMTAwWhcNMTYwMzE4MDgyMjAwWjCCAasxGDAWBgUqhQNkARINMTAyMzEw
MjI1NzY5NDEaMBgGCCqFAwOBAwEBEgwwMDMxMjcwNTEwMjYxJDAiBgkqhkiG9w0B
CQEWFXNvY3BvbGl0aWthQHlhbmRleC5ydTELMAkGA1UEBhMCUlUxNzA1BgNVBAge
LgAzADEAIAQRBDUEOwQzBD4EQAQ+BDQEQQQ6BDAETwAgBD4EMQQ7BDAEQQRCBEwx
FTATBgNVBAceDAQTBEMEMQQ6BDgEPTF3MHUGA1UECh5uBBwEQwQ9BDgERgQ4BD8E
MAQ7BEwEPQQ+BDUAIARDBEcEQAQ1BDYENAQ1BD0EOAQ1ACAEIwQ/BEAEMAQyBDsE
NQQ9BDgENQAgBEEEPgRGBDgEMAQ7BEwEPQQ+BDkAIAQ/BD4EOwQ4BEIEOAQ6BDgx
dzB1BgNVBAMebgQcBEMEPQQ4BEYEOAQ/BDAEOwRMBD0EPgQ1ACAEQwRHBEAENQQ2
BDQENQQ9BDgENQAgBCMEPwRABDAEMgQ7BDUEPQQ4BDUAIARBBD4ERgQ4BDAEOwRM
BD0EPgQ5ACAEPwQ+BDsEOARCBDgEOgQ4MGMwHAYGKoUDAgITMBIGByqFAwICJAAG
ByqFAwICHgEDQwAEQLXfb78Dw1C78iGdL2xj8Eq1YHptqn/HaWHGWMgVcNPZqT/3
EA/1kN297bBOFsxgygCttPqSktTxW3gOz5yxmjGjggVhMIIFXTAOBgNVHQ8BAf8E
BAMCBPAwGQYJKoZIhvcNAQkPBAwwCjAIBgYqhQMCAhUwNwYDVR0lBDAwLgYGKoUD
ZAICBgcqhQMCAiIZBgcqhQMCAiIGBggrBgEFBQcDAgYIKwYBBQUHAwQwHQYDVR0O
BBYEFDT6VW56l6jplbmsYNDEI+TeRtN7MIIB8wYDVR0jBIIB6jCCAeaAFH22gVr6
/kgqmyQcsySrYItGh69goYIBuqSCAbYwggGyMRgwFgYFKoUDZAESDTEwMjMxMDE2
NzA0MzcxGjAYBggqhQMDgQMBARIMMDAzMTIzMDc3MTExMSUwIwYJKoZIhvcNAQkB
FhZzZXJ2aWNldWNAYmVscmVnaW9uLnJ1MQswCQYDVQQGEwJSVTEgMB4GA1UECQwX
0J3QtdC60YDQsNGB0L7QstCwIDktMTUxMzAxBgNVBAgMKjMxINCR0LXQu9Cz0L7R
gNC+0LTRgdC60LDRjyDQvtCx0LvQsNGB0YLRjDEZMBcGA1UEBwwQ0JHQtdC70LPQ
vtGA0L7QtDFQME4GA1UECgxH0J7Qk9CR0KMg0JHQtdC70LPQvtGA0L7QtNGB0LrQ
uNC5INC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdGL0Lkg0YTQvtC90LQxMDAuBgNV
BAsMJ9Cj0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40Lkg0YbQtdC90YLRgDFQME4G
A1UEAwxH0KPQpiDQkNC00LzQuNC90LjRgdGC0YDQsNGG0LjQuCDQkdC10LvQs9C+
0YDQvtC00YHQutC+0Lkg0L7QsdC70LDRgdGC0LiCEEhwrmfjj5GpREU2Xl7Zwykw
gbEGA1UdHwSBqTCBpjBSoFCgToZMaHR0cDovL3VjYm8uYmVscmVnaW9uLnJ1L2Nh
L2NkcC83ZGI2ODE1YWZhZmU0ODJhOWIyNDFjYjMyNGFiNjA4YjQ2ODdhZjYwLmNy
bDBQoE6gTIZKaHR0cDovL3VjLmJlbHJlZ2lvbi5ydS9jYS9jZHAvN2RiNjgxNWFm
YWZlNDgyYTliMjQxY2IzMjRhYjYwOGI0Njg3YWY2MC5jcmwweAYIKwYBBQUHAQEE
bDBqMDIGCCsGAQUFBzABhiZodHRwOi8vdWNiby5iZWxyZWdpb24ucnUvb2NzcC9v
Y3NwLnNyZjA0BggrBgEFBQcwAoYoaHR0cDovL3VjYm8uYmVscmVnaW9uLnJ1L2Nh
L2NkcC9yb290LmNydDA0BgUqhQNkbwQrDCnQmtGA0LjQv9GC0L7Qn9GA0L4gQ1NQ
ICjQstC10YDRgdC40Y8gMy42KTAdBgNVHSAEFjAUMAgGBiqFA2RxATAIBgYqhQNk
cQIwKwYDVR0QBCQwIoAPMjAxNTAzMTgwODIxMDBagQ8yMDE2MDMxODA4MjEwMFow
ggEvBgUqhQNkcASCASQwggEgDCnQmtGA0LjQv9GC0L7Qn9GA0L4gQ1NQICjQstC1
0YDRgdC40Y8gMy42KQxS0KPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQuSDRhtC1
0L3RgtGAICLQmtGA0LjQv9GC0L7Qn9GA0L4g0KPQpiIg0LLQtdGA0YHQuNC4IDEu
NQxP0KHQtdGA0YLQuNGE0LjQutCw0YIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNGP
IOKEliDQodCkLzEyNC0yMjM4INC+0YIgMDQuMTAuMjAxMwxOQ9C10YDRgtC40YTQ
uNC60LDRgiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Y8g4oSWINCh0KQvMTI4LTIz
NTEg0L7RgiAxNS4wNC4yMDE0MAgGBiqFAwICAwNBALvBh0GkNGbZ7gG6JulOEUEQ
+Fz6nCkrgF+9x9Nw+ZEDMXd6X4qu6HKA/Nr2UyUhySVlXSxuCETnX0GGBITETYk=
</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411" /><ds:Reference URI="#1body"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411" /><ds:DigestValue>CTq3sCdniipSMMErmFAtQ4aQLqmmIuIGziQl3eYBY+I=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>AE6hb43k08FoX+PkZSG5LfvNMLyOYniKKMTDISVldKU3fhDO8r286IQUPgRaiM6A
oLjrhMRauFB1LZWB330+sw==</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" URI="#6005bb7a-b84f-4a09-ac2f-46e5f2100b48" /></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" u:Id="1body"><Process xmlns="http://service.pfr.socit.ru"><Message xmlns="http://smev.gosuslugi.ru/rev111111"><Sender><Code>PFRF01001</Code><Name>Пенсионный фонд РФ</Name></Sender><Recipient><Code>PFRF01001</Code><Name>Пенсионный фонд РФ</Name></Recipient><Originator><Code>PFRF01001</Code><Name>Пенсионный фонд РФ</Name></Originator><TypeCode>GSRV</TypeCode><Status>REQUEST</Status><Date>2015-08-26T15:53:44.9436877+03:00</Date><ExchangeType>2</ExchangeType><RequestIdRef /><OriginRequestIdRef /><CaseNumber /></Message><MessageData xmlns="http://smev.gosuslugi.ru/rev111111"><AppData><Type xmlns="http://data.service.pfr.socit.ru">REQUEST</Type><Properties xmlns="http://data.service.pfr.socit.ru"><Property><PropertyName>TYPE_QUERY</PropertyName><PropertyValue>ЗАПРОС_СВЕДЕНИЙ_О_РАЗМЕРЕ_ВЫПЛАТ</PropertyValue></Property><Property><PropertyName>METHOD</PropertyName><PropertyValue>QUERY_PENSION_FOR_PERIOD</PropertyValue></Property><Property><PropertyName>SECOND_NAME</PropertyName><PropertyValue>Афанасьева</PropertyValue></Property><Property><PropertyName>FIRST_NAME</PropertyName><PropertyValue>Ольга</PropertyValue></Property><Property><PropertyName>PATRONYMIC</PropertyName><PropertyValue>Михайловна</PropertyValue></Property><Property><PropertyName>SNILS</PropertyName><PropertyValue>010-992-864 54</PropertyValue></Property><Property><PropertyName>BIRTH_DATE</PropertyName><PropertyValue>26.05.1956</PropertyValue></Property><Property><PropertyName>GENDER</PropertyName><PropertyValue>ЖЕНСКИЙ</PropertyValue></Property><Property><PropertyName>DATE_BEG_PERIOD</PropertyName><PropertyValue>26.02.2015</PropertyValue></Property><Property><PropertyName>SUPPLY_MONTHS</PropertyName><PropertyValue>6</PropertyValue></Property><Property><PropertyName>DATE_OF_FILLING</PropertyName><PropertyValue>26.08.2015</PropertyValue></Property><Property><PropertyName>DPTCOD</PropertyName><PropertyValue>041000</PropertyValue></Property></Properties><FilePFR xmlns="http://data.service.pfr.socit.ru" /></AppData></MessageData></Process></s:Body></s:Envelope>